In [1]:
import pandas as pd

In [2]:
df = pd.read_clipboard()

In [5]:
df

      ID NAMES
ROW1   1     A
ROW2   2     B
ROW3   3     C
ROW4   4     D
ROW5   5     E
ROW6   6     F
ROW7   7     G
ROW8   8     H
ROW9   9     I

In [8]:
df.head()

      ID NAMES
ROW1   1     A
ROW2   2     B
ROW3   3     C
ROW4   4     D
ROW5   5     E

In [9]:
df.iloc[5,1]

'F'

In [16]:
df.iloc[4:6,0:] = 4,'E'

In [17]:
df

      ID NAMES
ROW1   1     A
ROW2   2     B
ROW3   3     C
ROW4   4     D
ROW5   4     E
ROW6   4     E
ROW7   7     G
ROW8   8     H
ROW9   9     I

In [20]:
df['NEW_COL'] = 60

In [21]:
df

      ID NAMES  NEW_COL
ROW1   1     A       60
ROW2   2     B       60
ROW3   3     C       60
ROW4   4     D       60
ROW5   4     E       60
ROW6   4     E       60
ROW7   7     G       60
ROW8   8     H       60
ROW9   9     I       60

In [22]:
df['NEW_COL'] = "ABC"

In [23]:
df

      ID NAMES NEW_COL
ROW1   1     A     ABC
ROW2   2     B     ABC
ROW3   3     C     ABC
ROW4   4     D     ABC
ROW5   4     E     ABC
ROW6   4     E     ABC
ROW7   7     G     ABC
ROW8   8     H     ABC
ROW9   9     I     ABC

In [24]:
dic = {}

In [25]:
dic["ID"] = 10

In [38]:
dic["NAMES"] = "J"

In [39]:
dic['NEW_COL'] = "ABC"

In [41]:
dic.pop('Names')

'J'

In [44]:
new_df = pd.DataFrame([dic],index = ["ROW10"])

In [45]:
dic

{'ID': 10, 'NEW_COL': 'ABC', 'NAMES': 'J'}

In [46]:
new_df

       ID NEW_COL NAMES
ROW10  10     ABC     J

In [47]:
sample_df = pd.concat([df,new_df])

In [50]:
sample_df

       ID NAMES NEW_COL
ROW1    1     A     ABC
ROW2    2     B     ABC
ROW3    3     C     ABC
ROW4    4     D     ABC
ROW5    4     E     ABC
ROW6    4     E     ABC
ROW7    7     G     ABC
ROW8    8     H     ABC
ROW9    9     I     ABC
ROW10  10     J     ABC

In [52]:
sample_df.to_clipboard(index = False)

In [ ]:
ID	NAMES	NEW_COL
1	A	ABC
2	B	ABC
3	C	ABC
4	D	ABC
4	E	ABC
4	E	ABC
7	G	ABC
8	H	ABC
9	I	ABC
10	J	ABC